import React from "react";

const PpaPage = () => {
  return (
    <>
      <div className="content-w-full content-px-none">
        <div className="overflow-hidden bg-main-bg bg-[length:3856px_572px] bg-center">
          <div className="mx-auto flex h-[calc(100vh_-_572px)] w-full min-w-[1240px] max-w-[1920px] flex-col items-center justify-center align-bottom text-primary-500">
            <p className="title-md-bold mb-[10px] align-bottom">
              우리는 당신의 개인정보 보호와 신뢰를 중요하게 생각합니다.
            </p>
            <p className="title-xs-regular mb-[30px] flex justify-center text-center">
              개인정보 보호 센터는 고객의 정보를
              <br />
              수집해서 사용하는 방법에 대한 고객의 선택 사항을 비롯하여
              <br />
              개인정보 보호 항목에 대한 정보를 쉽게 찾을 수 있도록 해 줍니다.
            </p>
          </div>
        </div>

        <div className="p-[100px]">
          <p className="title-sm-bold">제1조 (목적)</p>
          <p>
            이 약관은 회사가 제공하는 [플로디텍터] (이하 "서비스")의 이용에 관한
            조건 및 절차, 회사와 이용자 간의 권리, 의무 및 책임사항을 규정함을
            목적으로 합니다.
          </p>
          <p className="title-sm-bold mt-3">제2조 (정의)</p>
          <p>1. "서비스"란 [플로디텍터]의 모든 기능을 의미합니다.</p>
          <p>
            2. "이용자"란 본 약관에 따라 회사가 제공하는 서비스를 이용하는 모든
            고객을 말합니다.
          </p>
          <p>
            3. "회원"이란 서비스에 개인정보를 제공하여 회원가입을 한 자로서,
            계속적으로 회사가 제공하는 서비스를 이용할 수 있는 자를 의미합니다.
          </p>
          <p className="title-sm-bold mt-3">제3조 (약관의 효력 및 변경)</p>
          <p>
            1. 본 약관은 이용자가 서비스에 접속하거나 이용함과 동시에 그 효력이
            발생합니다.
          </p>
          <p>
            2. 회사는 약관의 변경이 있을 경우 변경된 내용을 서비스 내 공지사항에
            게시하며, 변경된 약관은 게시와 동시에 효력이 발생합니다.
          </p>
          <p>
            3. 이용자가 변경된 약관에 동의하지 않는 경우, 서비스 이용을 중단하고
            회원 탈퇴를 요청할 수 있습니다. 변경된 약관의 효력 발생일 이후에도
            서비스를 계속 이용할 경우, 변경된 약관에 동의한 것으로 간주합니다.
          </p>
          <p className="title-sm-bold mt-3">제4조 (서비스 이용)</p>
          <p>
            1. 서비스는 연중무휴, 24시간 제공함을 원칙으로 합니다. 다만, 시스템
            유지보수, 기술적 문제, 운영 상의 필요에 따라 회사는 서비스의 전부
            또는 일부를 중단할 수 있습니다.
          </p>
          <p>
            2. 회사는 서비스의 내용, 이용 방법, 이용 시간에 대해 변경할 수
            있으며, 이 경우 사전에 이용자에게 공지합니다.
          </p>
          <p className="title-sm-bold mt-3">제5조 (이용자 의무)</p>
          <p>
            1. 이용자는 본 약관 및 관계 법령을 준수해야 하며, 다음의 행위를
            하여서는 안 됩니다:
          </p>
          <ul className="p-3">
            <li>타인의 개인정보를 도용하는 행위</li>
            <li>회사의 지적 재산권을 침해하는 행위</li>
            <li>서비스의 운영을 방해하는 행위</li>
            <li>기타 불법적이거나 부적절한 행위</li>
          </ul>
          <p>
            2. 이용자는 서비스 이용 시 발생하는 모든 활동에 대해 책임을 집니다.
          </p>
          <p className="title-sm-bold mt-3">제6조 (개인정보 보호)</p>
          <p>
            회사는 이용자의 개인정보를 관련 법령에 따라 적절히 보호하며,
            개인정보 처리 방침에 따라 처리합니다.
          </p>
          <p className="title-sm-bold mt-3">제7조 (지적 재산권)</p>
          <p>
            1. 회사가 작성한 저작물에 대한 저작권 및 기타 지적 재산권은 회사에
            귀속됩니다.
          </p>
          <p>
            2. 이용자는 회사가 제공하는 서비스를 이용함으로써 얻은 정보를 회사의
            사전 승낙 없이 복제, 송신, 출판, 배포 등의 방법으로 이용하거나
            제3자에게 제공할 수 없습니다.
          </p>
          <p className="title-sm-bold mt-3">제8조 (서비스 중단)</p>
          <p>
            회사는 천재지변, 비상사태, 설비 장애 또는 기타 불가피한 사유로
            서비스가 중단될 경우, 이에 대한 책임을 지지 않습니다.
          </p>
          <p className="title-sm-bold mt-3">제9조 (이용 해지 및 자격 상실)</p>
          <p>
            1. 이용자가 서비스 이용을 원치 않을 경우, 언제든지 서비스 내에서
            탈퇴할 수 있습니다.
          </p>
          <p>
            2. 회사는 이용자가 본 약관을 위반하거나, 법령을 위반한 경우 사전
            통보 없이 이용자의 서비스 이용 자격을 제한하거나 상실시킬 수
            있습니다.
          </p>
          <p className="title-sm-bold mt-3">제10조 (책임의 한계)</p>
          <p>
            1. 회사는 천재지변, 불가항력, 또는 이용자의 과실로 인해 발생한
            서비스 이용 장애에 대해 책임을 지지 않습니다.
          </p>
          <p>
            2. 회사는 이용자가 서비스를 이용하여 기대하는 이익을 얻지 못하거나,
            발생한 손해에 대해 책임을 지지 않습니다.
          </p>
          <p className="title-sm-bold mt-3">제11조 (준거법 및 관할)</p>
          <p>
            본 약관은 대한민국 법령에 따라 해석되고 적용되며, 서비스 이용과
            관련하여 발생하는 모든 분쟁은 [회사 본사 소재지]의 관할 법원에
            따릅니다.
          </p>
          <p className="title-sm-bold mt-3">부칙</p>
          <p>1. 이 약관은 [시행일]부터 적용됩니다.</p>
          <p>
            2. 본 약관에 명시되지 않은 사항은 관련 법령 및 상관례에 따릅니다.
          </p>
        </div>
      </div>
    </>
  );
};

export default PpaPage;
